; domain
(define (domain recycle_underpants)
  (:requirements :strips :typing)

  (:types
    item
    underpants - item
    tool - item
    plant
    location - object
  )

  (:predicates
    ;; 位置谓词
    (at ?obj - item ?loc - location)
    ;; 内裤的属性
    (is_old ?u - underpants)
    ;; 内裤的用途
    (used_as_cleaning_rags ?u - underpants)
    (used_as_garden_ties ?u - underpants)
    (used_as_craft_item ?u - underpants)
    (used_as_stuffing ?u - underpants)
    (worn_by_child ?u - underpants)
    (donated ?u - underpants)
    ;; 植物的属性
    (tied ?pl - plant)
    ;; 工具状态
    (available ?t - tool)
  )

  ;; 动作1: 将内裤变成清洁抹布
  (:action make_cleaning_rags
    :parameters (?u - underpants)
    :precondition (and
      (at ?u drawer)
      (not (is_old ?u))
    )
    :effect (and
      (is_old ?u)
      (used_as_cleaning_rags ?u)
    )
  )

  ;; 动作2: 使用内裤作为园艺绑带
  (:action make_garden_ties
    :parameters (?u - underpants ?t - tool ?pl - plant)
    :precondition (and
      (at ?u drawer)
      (available ?t)
      (not (is_old ?u))
    )
    :effect (and
      (is_old ?u)
      (used_as_garden_ties ?u)
      (tied ?pl)
    )
  )

  ;; 动作3: 将内裤制作成工艺品
  (:action make_craft_item
    :parameters (?u - underpants ?t - tool)
    :precondition (and
      (at ?u drawer)
      (available ?t)
      (not (is_old ?u))
    )
    :effect (and
      (is_old ?u)
      (used_as_craft_item ?u)
    )
  )

  ;; 动作4: 将内裤用作填充物
  (:action use_as_stuffing
    :parameters (?u - underpants)
    :precondition (and
      (at ?u drawer)
      (is_old ?u)
    )
    :effect (used_as_stuffing ?u)
  )

  ;; 动作5: 孩子穿着旧内裤玩超级英雄
  (:action child_wears_underpants
    :parameters (?u - underpants)
    :precondition (and
      (at ?u drawer)
      (is_old ?u)
    )
    :effect (worn_by_child ?u)
  )

  ;; 动作6: 捐赠内裤
  (:action donate_underpants
    :parameters (?u - underpants)
    :precondition (and
      (at ?u drawer)
      (is_old ?u)
    )
    :effect (donated ?u)
  )
)

; problem
(define (problem recycle_underpants_problem)
  (:domain recycle_underpants)

  (:objects
    underpants1 underpants2 underpants3 underpants4 underpants5 underpants6 - underpants
    scissors1 - tool
    plant1 - plant
    drawer - location
  )

  (:init
    ;; 内裤的初始状态
    (at underpants1 drawer)
    (at underpants2 drawer)
    (at underpants3 drawer)
    (at underpants4 drawer)
    (at underpants5 drawer)
    (at underpants6 drawer)

    ;; 工具的初始状态
    (available scissors1)
  )

  (:goal
    (and
      (used_as_cleaning_rags underpants1)
      (used_as_garden_ties underpants2)
      (tied plant1)
      (used_as_craft_item underpants3)
      (used_as_stuffing underpants4)
      (worn_by_child underpants5)
      (donated underpants6)
    )
  )
)

; plan
1. (make_cleaning_rags underpants6)
   added: (is_old underpants6) (used_as_cleaning_rags underpants6)
   goals met: 0 of 7
2. (make_cleaning_rags underpants5)
   added: (is_old underpants5) (used_as_cleaning_rags underpants5)
   goals met: 0 of 7
3. (make_cleaning_rags underpants4)
   added: (is_old underpants4) (used_as_cleaning_rags underpants4)
   goals met: 0 of 7
4. (donate_underpants underpants6)
   added: (donated underpants6)
   goals met: 1 of 7
5. (child_wears_underpants underpants5)
   added: (worn_by_child underpants5)
   goals met: 2 of 7
6. (use_as_stuffing underpants4)
   added: (used_as_stuffing underpants4)
   goals met: 3 of 7
7. (make_craft_item underpants3 scissors1)
   added: (is_old underpants3) (used_as_craft_item underpants3)
   goals met: 4 of 7
8. (make_garden_ties underpants2 scissors1 plant1)
   added: (is_old underpants2) (used_as_garden_ties underpants2) (tied plant1)
   goals met: 6 of 7
9. (make_cleaning_rags underpants1)
   added: (is_old underpants1) (used_as_cleaning_rags underpants1)
   goals met: 7 of 7
